In [49]:
import pymysql

In [19]:
conn = pymysql.connections

In [21]:
conn = conn.Connection(
    host = "localhost",
    user = "root",
    password = "Abhishek@123",
    database = "abhishek",
    port = 3306
)
conn

In [9]:
table_name = "employees"
query = f"SELECT * FROM {table_name};"

In [11]:
p = conn.cursor()

In [13]:
p.execute(f"SELECT * FROM {table_name};")

5

In [19]:
p.fetchall()

((1,
  'Alice Johnson',
  30,
  'HR',
  Decimal('50000.00'),
  datetime.date(2020, 5, 15)),
 (2, 'Bob Smith', 40, 'IT', Decimal('75000.00'), datetime.date(2018, 7, 23)),
 (3,
  'Charlie Brown',
  35,
  'Finance',
  Decimal('62000.00'),
  datetime.date(2019, 11, 1)),
 (4,
  'David Lee',
  28,
  'Marketing',
  Decimal('45000.00'),
  datetime.date(2021, 3, 12)),
 (5, 'Emma Davis', 32, 'IT', Decimal('80000.00'), datetime.date(2017, 9, 18)))

In [43]:
t = conn.cursor()
t.close()

In [47]:
import pymysql.cursors as crr

In [69]:
tt = crr.DictCursor(conn)

In [71]:
tt.execute("SELECT * FROM employees;")

5

In [73]:
oo = tt.fetchall()
oo

[{'id': 1,
  'name': 'Alice Johnson',
  'age': 30,
  'department': 'HR',
  'salary': Decimal('50000.00'),
  'join_date': datetime.date(2020, 5, 15)},
 {'id': 2,
  'name': 'Bob Smith',
  'age': 40,
  'department': 'IT',
  'salary': Decimal('75000.00'),
  'join_date': datetime.date(2018, 7, 23)},
 {'id': 3,
  'name': 'Charlie Brown',
  'age': 35,
  'department': 'Finance',
  'salary': Decimal('62000.00'),
  'join_date': datetime.date(2019, 11, 1)},
 {'id': 4,
  'name': 'David Lee',
  'age': 28,
  'department': 'Marketing',
  'salary': Decimal('45000.00'),
  'join_date': datetime.date(2021, 3, 12)},
 {'id': 5,
  'name': 'Emma Davis',
  'age': 32,
  'department': 'IT',
  'salary': Decimal('80000.00'),
  'join_date': datetime.date(2017, 9, 18)}]

In [57]:
import pandas as pd

In [75]:
c = pd.DataFrame(oo)

In [77]:
c

   id           name  age department    salary   join_date
0   1  Alice Johnson   30         HR  50000.00  2020-05-15
1   2      Bob Smith   40         IT  75000.00  2018-07-23
2   3  Charlie Brown   35    Finance  62000.00  2019-11-01
3   4      David Lee   28  Marketing  45000.00  2021-03-12
4   5     Emma Davis   32         IT  80000.00  2017-09-18

In [79]:
c.to_csv("my_sql.csv")

In [3]:
#important libraries to import 
import pandas as pd
import pymysql
import pymysql.cursors as crr

In [5]:
host = input("enter the name of your host")
user = input('enter the name of your user')
password = input("enter the password")
database = input("enter the name of your database")
port = int(input("enter the port number "))
def establish_connection(host: str, user: str, password: str, database: str, port: int) -> pymysql.connections.Connection :
    conn = pymysql.connections
    conn = conn.Connection(
        host = host,
        user = user, 
        password = password,
        database = database,
        port = port
    )
    return conn

enter the name of your host localhost
enter the name of your user root
enter the password Abhishek@123
enter the name of your database abhishek
enter the port number  3306

In [7]:
table_name = input("enter the name of your table")
def sqlprocess(table_name):
    query = f"SELECT * FROM {table_name};"
    conn = establish_connection(host, user, password, database, port)
    tt = crr.DictCursor(conn)
    tt.execute(f"SELECT * FROM {table_name};")
    oo = tt.fetchall()
    return oo

enter the name of your table employees

In [9]:
name = input("enter the name for your csv")
def processtocsv(name):
    oo = sqlprocess(table_name)
    c = pd.DataFrame(oo)
    d = c.to_csv(f"{name}.csv", encoding = "UTF-8")
    return d
processtocsv(name)

enter the name for your csv abhishek

In [11]:
a = pd.read_csv("abhishek.csv")
b = pd.DataFrame(a)
b

   Unnamed: 0  id           name  age department   salary   join_date
0           0   1  Alice Johnson   30         HR  50000.0  2020-05-15
1           1   2      Bob Smith   40         IT  75000.0  2018-07-23
2           2   3  Charlie Brown   35    Finance  62000.0  2019-11-01
3           3   4      David Lee   28  Marketing  45000.0  2021-03-12
4           4   5     Emma Davis   32         IT  80000.0  2017-09-18

In [25]:
def close_connection(name):
    cc = establish_connection(host, user, password, database, port).close()
    return f"your csv file name is {name}.csv, connection is closed with server"

close_connection(name)

'your csv file name is abhishek.csv, connection is closed with server'